#include "main.h"

char botToken[50] = "";  // your Bot Token (Get from Botfather);
char chatID [15] = "";   // your Chat ID (search for “IDBot” or open this link t.me/myidbot in your smartphone.)
char displStr[16];
uint8_t dataLed[6]; 
int8_t dataOut[6] = {-1,-1,-1,-1,-1,-1};

bool shouldSaveConfig = false;//flag for saving data
bool enabledListen = false;

uint8_t numberOfDevices,    // число найденых датчиков
        displNum,           // вариант дисплея
        resetDispl,         // время ожидания до возврата главного диплея
        numSetup,           // пунк выбора установки
        halfSecond,         // счетчик полу-секунд
        pvFlap,             // текущее положение заслонки
        beepOn,             // время звучания бипера
        disableBeep,        // время запрета включения аварийной сигнализации
        lastKey,            // последняя нажатая кнопка
        keys,               // текущая кнопка
        keyCount,           // время удержания последней кнопки
        countSeconds;       // счетчик секунд

int16_t pvAeration,         // текущее время проветривания
        pvVenting,          // ? текущее время проветривания
        editBuff;           // временное хранилище редактируемой установки

uint16_t    pvRH,           // текущая относительная влажность
            pvTimer,        // текущее значение таймера
            waitCheckKeyPad = WAITCHECKKEYPAD;

long counterWait,           // опорный интервал опроса кнопок
        counter10,          // опорный интервал 10 милисекунд 
        counter1s;          // опорный интервал 500 милисекунд

// Адрес PCF8574. Может быть разным в зависимости от конфигурации A0, A1, A2.
// Стандартные адреса: 0x20-0x27 для PCF8574 и 0x38-0x3F для PCF8574A.
// Уточните адрес вашего модуля. Часто по умолчанию 0x27 или 0x3F.
#define PCF8574_ADDRESS 0x27 // Замените на ваш адрес, если необходимо
//---------------------------------
uint8_t earlyMode = 0, mode = READEEPROM, tmrResetMode = 0, quarter = GET_PROG1, errors, seconds = 0;
int tmrTelegramOff = 30;
long lastSendTime = 0, allTime = 0; 
Interval interval = INTERVAL_1000;
//---------------------------------
Ds ds[2] = {{150,0,0,0,0},{100,0,0,0,0}};
float dpv0, dpv1;
//---------------------------------

union Byte portOut;
union Byte errorsFlag;
union Byte portFlag;

TableBuff unTable = {
    .spHour = {
    .spT0on = T0ON, 	    // 0-120 Уставка температуры T0 ON
    .spT0off = T0OFF, 	    // 0-120 Уставка температуры T0 OFF
    .spT1on = T1ON, 	    // 0-120 Уставка температуры T1 или 0-100 Уставка относительной влажности ON
    .spT1off = T1OFF, 	    // 0-120 Уставка температуры T1 или 0-100 Уставка относительной влажности OFF
    .water0on = WT0ON,      // 0-120 мин. Длительность включ.состояниe полива № 1
    .water0off = WT0OFF,    // 0-15 пункт. Длительность отвключ.состояниe полива № 1
    .water1on = WT1ON,      // 0-120 мин. Длительность включ.состояниe полива № 2
    .water1off = WT1OFF,    // 0-15 пункт. Длительность отвключ.состояниe полива № 2
    .water2on = WT2ON,      // 0-120 мин. Длительность включ.состояниe полива № 3
    .water2off = WT2OFF,    // 0-15 пункт. Длительность отвключ.состояниe полива № 3
    .flap = 0,              // 0-100 Заслонка текущее положение
    .timerOn = TIMERON,     // 0-24
    .timerOff = TIMEROFF,   // 0-24
    .alarm0 = ALARM0,       // 0-120 отклонение температуры T0
    .alarm1 = ALARM1,       // 0-120 отклонение температуры T1
    .special = 0,
    }
};

const uint8_t tabRH[420]={
95,90,86,81,77,72,68,64,60,56,52,48,44,40,36,32,29,25,22,18,
95,91,86,82,77,73,69,65,61,57,53,49,45,42,38,34,31,27,24,20,
95,91,87,82,78,74,70,66,62,58,54,50,47,43,40,36,33,29,26,23,
96,91,87,83,79,75,71,67,63,59,55,52,48,45,41,38,34,31,28,25,
96,91,87,83,79,75,71,67,64,60,56,53,49,46,43,39,36,33,30,26,
96,92,88,84,80,76,72,68,65,61,57,54,51,47,44,41,37,34,31,28,
96,92,88,84,80,76,73,69,65,62,58,55,52,48,45,42,39,36,33,30,
96,92,88,84,80,77,73,70,66,63,59,56,53,50,46,43,40,37,34,32,
96,92,88,85,81,77,74,70,67,64,60,57,54,51,48,45,42,39,36,33,
96,92,89,85,81,78,74,71,68,64,61,58,55,52,49,46,43,40,37,35,
96,92,89,85,82,78,75,71,68,65,62,59,56,53,50,47,44,41,39,36,
96,93,89,85,82,79,75,72,69,66,63,60,57,54,51,48,45,42,40,37,
96,93,89,86,82,79,76,73,69,66,63,60,57,55,52,49,46,44,41,38,
96,93,89,86,83,79,76,73,70,67,64,61,58,55,53,50,47,45,42,40,
96,93,90,86,83,80,77,74,71,68,65,62,59,56,54,51,48,46,43,41,
97,93,90,87,83,80,77,74,71,68,65,62,60,57,54,52,49,47,44,42,
97,93,90,87,84,80,77,74,72,69,66,63,60,58,55,53,50,48,45,43,
97,93,90,87,84,81,78,75,72,69,66,64,61,58,56,53,51,48,46,44,
97,93,90,87,84,81,78,75,72,70,67,64,62,59,57,54,52,49,47,45,
97,94,90,87,84,81,79,76,73,70,67,65,62,60,57,55,52,50,48,46,
97,94,91,88,85,82,79,76,73,71,68,65,63,60,58,56,53,51,49,46
};